---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCFileModelOptions.SchemaName
source: html/5cb33cf3-5870-2afa-6ad1-e3fafc0a640a.htm
---
# Autodesk.Revit.DB.IFC.IFCFileModelOptions.SchemaName Property

The name of the schema.

## Syntax (C#)
```csharp
public string SchemaName { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null